## 練習時間
資料的操作有很多，接下來的馬拉松中我們會介紹常被使用到的操作，參加者不妨先自行想像一下，第一次看到資料，我們一般會想知道什麼訊息？

#### Ex: 如何知道資料的 row 數以及 column 數、有什麼欄位、多少欄位、如何截取部分的資料等等

有了對資料的好奇之後，我們又怎麼通過程式碼來達成我們的目的呢？

#### 可參考該[基礎教材](https://bookdata.readthedocs.io/en/latest/base/01_pandas.html#DataFrame-%E5%85%A5%E9%97%A8)或自行 google

In [3]:
import os
import numpy as np
import pandas as pd

In [4]:
# 設定 data_path
dir_data = './data/'

In [5]:
f_app = os.path.join(dir_data, 'application_train.csv')
print('Path of read in data: %s' % (f_app))
app_train = pd.read_csv(f_app)

Path of read in data: ./data/application_train.csv

### 如果沒有想法，可以先嘗試找出剛剛例子中提到的問題的答案
#### 資料的 row 數以及 column 數

In [15]:
app_train.shape

(8, 106)

#### 列出所有欄位

In [36]:
app_train.columns

Index(['SK_ID_CURR', 'TARGET', 'CNT_CHILDREN', 'AMT_INCOME_TOTAL',
       'AMT_CREDIT', 'AMT_ANNUITY', 'AMT_GOODS_PRICE',
       'REGION_POPULATION_RELATIVE', 'DAYS_BIRTH', 'DAYS_EMPLOYED',
       ...
       'FLAG_DOCUMENT_18', 'FLAG_DOCUMENT_19', 'FLAG_DOCUMENT_20',
       'FLAG_DOCUMENT_21', 'AMT_REQ_CREDIT_BUREAU_HOUR',
       'AMT_REQ_CREDIT_BUREAU_DAY', 'AMT_REQ_CREDIT_BUREAU_WEEK',
       'AMT_REQ_CREDIT_BUREAU_MON', 'AMT_REQ_CREDIT_BUREAU_QRT',
       'AMT_REQ_CREDIT_BUREAU_YEAR'],
      dtype='object', length=106)

#### 截取部分資料

In [26]:
app_train[['SK_ID_CURR', 'CNT_CHILDREN', 'AMT_INCOME_TOTAL','DAYS_BIRTH']]

          SK_ID_CURR   CNT_CHILDREN  AMT_INCOME_TOTAL     DAYS_BIRTH
count  307511.000000  307511.000000      3.075110e+05  307511.000000
mean   278180.518577       0.417052      1.687979e+05  -16036.995067
std    102790.175348       0.722121      2.371231e+05    4363.988632
min    100002.000000       0.000000      2.565000e+04  -25229.000000
25%    189145.500000       0.000000      1.125000e+05  -19682.000000
50%    278202.000000       0.000000      1.471500e+05  -15750.000000
75%    367142.500000       1.000000      2.025000e+05  -12413.000000
max    456255.000000      19.000000      1.170000e+08   -7489.000000

In [48]:
app_train.loc[:,['SK_ID_CURR','CNT_CHILDREN']]

          SK_ID_CURR   CNT_CHILDREN
count  307511.000000  307511.000000
mean   278180.518577       0.417052
std    102790.175348       0.722121
min    100002.000000       0.000000
25%    189145.500000       0.000000
50%    278202.000000       0.000000
75%    367142.500000       1.000000
max    456255.000000      19.000000

#### 還有各種數之不盡的資料操作，重點還是取決於實務中遇到的狀況和你想問的問題，在馬拉松中我們也會陸續提到更多例子